
$(function () {

    $('#random').click(function () {
        var names = ["אבשי", "אוגו", "אגוזית", "אגימו", "אדיסון", "אוגי", "אוליבר", "אומץ", "איימי", "ארצ'י", "אלבי","איזי","איב"
            , "באגס", "באף", "בארני", "בומר", "בובה", "בוטן", "ביגלה", "במבה", "בסטר", "בץ", "בקהאם", "בינקי", "בוטן", "בוני"
            , "ג'וקר", "ג'אמפר", "ג'וי", "ג'ימבו", "גנדי", "גארפילד", "גוליבר", "גולי", "גמג'ו", "גולדה", "ג'סיקה", "ג'וני", "ג'ורדן"
            , "דאג", "דולצ'ה", "דיפסי", "דמקה", "דמבו", "דיקסי", "דומינו", "דוט", "דודלי", "דאפי", "דובי", "דוק", "דרייפוס"
            , "האג", "הומר", "הארלי", "הנרי", "הרמוני", "הרצל", "הרקולס", "היפר", "הוריקן", "הנזו", "המלט", "הינדי", "האנטר", "האג"
            , "וגאס", "וואפי", "ווינדי", "וויב", "וולבי", "ווקר", "וקטור", "ולנטיין", "ונוס", "ונילה", "וניל", "וילי", "ויני", "ויקטור"
            , "זאב", "זאוס", "זאזי", "זאפה", "זארה", "זורו", "זיג", "זיגי", "זיגמונד", "זיפ", "זיפו", "זלמן", "זולה" 
            , "חביאר", "חואן", "חואניטה", "חוליו", "חומוס", "חומי", "חזי", "חץ", "חתול", "חיים", "חלבה", "חוה", "חנן", "חידה"
            , "טאו", "טאי", "טאקו", "טדי", "טובי", "טוי", "טופי", "טורבו", "טייגר", "טייסון", "טייפון", "טוני", "טוליפ", "טויינקי"
            , "יהלום", "יוגה", "יופי", "יופיטר", "יאמי", "יאנג", "ירמיהו", "יס", "יצפאן", "ירקון", "יופלי", "יוגורט", "יוגי", "יוסטון"
            , "כאוס", "כווץ'", "כיף", "כספר", "כריסטוף", "כריסטופר", "כריס", "כרמלו", "כתם", "כרמן", "כרמלה", "כוכי", "כתר"
            , "לאבר", "לאון", "לאונרדו", "לאקי", "לגו", "לוטו", "לוצ'י", "לוטוס", "לולה", "לופ", "לונה", "לקסי", "לוקה", "לורד","לוצ'יפר"
            , "מאגנום", "מדאם", "מדונה", "מטילדה", "מולאן", "מג'יק", "מואנה", "מנטה", "מותק", "מקס", "מוצארט", "מייפל", "מאפין", "מאנץ'"
            , "נאפסטר", "נלסון", "ניקיטה", "נולה", "נפוליאון", "נילס", "ניטצ'ה", "נורמן", "נזק", "האג", "נענע", "נץ", "נוטלה", "נמש"
            , "סאנטוס", "סנצ'ו", "סאני", "סבסטיאן", "סול", "סוני", "סופה", "סושי", "סופי", "סנואו", "סקיי", "סימבה", "סייבר", "סטאר"
            , "עדנה", "עוג", "עוגי", "עוגיפלצת", "עוז", "עוגן", "עמוס", "עליזה", "עלמה", "ענן", "עוקץ", "עוץ", "עצם", "ערק"
            , "פאוור", "פאן", "פאם", "פאנטום", "פודינג", "פלוטו", "פיטר פן", "פיסטוק", "פיקאצ'ו", "פיצי", "פיבי", "פטל", "פיג'י", "פאקמן"
            , "צ'אבי", "צ'אמפ", "צ'אפי", "צ'אק", "צ'ואי", "צ'ופ", "צ'ייסר", "צ'ילי", "צ'יקיטה", "צוף", "צמר", "ציפי", "צ'יפס", "צ'סטר"
            , "קאווה", "קיפי", "קוקה", "קארמה", "קוקו", "קודי", "קובה", "קארי", "קילר", "קישקשתא", "קינג", "קוקי", "קוטג'", "קאסי"
            , "רג'י", "רובין", "רומיאו", "רוס", "רופי", "ריי", "רוקט", "רוקסי", "רקס", "רד", "ראלף", "רום", "רוטשילד", "רנדי"
            , "שוג", "שוגה", "שלגיה", "שלג", "שבי", "שאנטי", "שרק", "שרלוק", "שרגא", "שיקגו", "שאקירה", "שייקה", "שמשון", "שולץ"
            , "תאי", "תולי", "תום", "תיקה", "תות", "תותי", "תומס", "תיגר", "תומי", "תימי", "תרצה", 
        ];

        var name = names[Math.floor(Math.random() * names.length)];


        $('#result').html(name);
    });

});

//var str = "";

//$('.texas > p.cn').each(function () {
//    str += $(this).text() + "<br>";
//})

//$('#mysidebarID').html(str);



    //var nameList = $('name').attr('class');

    //$('#result').html(nameList[0]);